## 🧾 Terraform Plan for `sec_ebs_snapshot_guard`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.advanced_snapshot_guard.aws_cloudwatch_event_rule.public_snapshot_alert will be created
  + resource "aws_cloudwatch_event_rule" "public_snapshot_alert" {
      + arn            = (known after apply)
      + description    = "Alerts on creation or modification of public EBS snapshots."
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName         = [
                      + "ModifySnapshotAttribute",
                    ]
                  + eventSource       = [
                      + "ec2.amazonaws.com",
                    ]
                  + requestParameters = {
                      + attributeType = [
                          + "createVolumePermission",
                        ]
                      + operationType = [
                          + "add",
                        ]
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "advanced-ebs-guard-public-snapshot-alert"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.advanced_snapshot_guard.aws_cloudwatch_event_target.sns_alert will be created
  + resource "aws_cloudwatch_event_target" "sns_alert" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "advanced-ebs-guard-public-snapshot-alert"
      + target_id      = "SnapshotAlertSNS"
    }

  # module.advanced_snapshot_guard.aws_dlm_lifecycle_policy.snapshot_retention_policy will be created
  + resource "aws_dlm_lifecycle_policy" "snapshot_retention_policy" {
      + arn                = (known after apply)
      + description        = "EBS Snapshot retention and auto-deletion"
      + execution_role_arn = (known after apply)
      + id                 = (known after apply)
      + state              = "ENABLED"
      + tags_all           = (known after apply)

      + policy_details {
          + policy_type        = "EBS_SNAPSHOT_MANAGEMENT"
          + resource_locations = (known after apply)
          + resource_types     = [
              + "VOLUME",
            ]
          + target_tags        = {
              + "SnapshotManaged" = "true"
            }

          + schedule {
              + copy_tags = true
              + name      = "DailySnapshotRetention"

              + create_rule {
                  + interval      = 12
                  + interval_unit = "HOURS"
                  + location      = (known after apply)
                  + times         = [
                      + "00:00",
                    ]
                }

              + retain_rule {
                  + count = 14
                }
            }
        }
    }

  # module.advanced_snapshot_guard.aws_iam_policy.snapshot_encryption_policy will be created
  + resource "aws_iam_policy" "snapshot_encryption_policy" {
      + arn         = (known after apply)
      + description = "Policy enforcing EBS snapshot encryption."
      + id          = (known after apply)
      + name        = "advanced-ebs-guard-snapshot-encryption"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:CreateSnapshot",
                          + "ec2:CreateSnapshots",
                        ]
                      + Condition = {
                          + StringNotEqualsIfExists = {
                              + "ec2:Encrypted" = "true"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.advanced_snapshot_guard.aws_iam_role.dlm_role will be created
  + resource "aws_iam_role" "dlm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dlm.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "advanced-ebs-guard-dlm-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.advanced_snapshot_guard.aws_iam_role_policy_attachment.dlm_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "dlm_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSDataLifecycleManagerServiceRole"
      + role       = "advanced-ebs-guard-dlm-role"
    }

  # module.advanced_snapshot_guard.aws_sns_topic.snapshot_alerts_topic will be created
  + resource "aws_sns_topic" "snapshot_alerts_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "advanced-ebs-guard-snapshot-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.advanced_snapshot_guard.aws_sns_topic_subscription.alert_email[0] will be created
  + resource "aws_sns_topic_subscription" "alert_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "security-team@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.advanced_snapshot_guard.aws_sns_topic_subscription.alert_email[1] will be created
  + resource "aws_sns_topic_subscription" "alert_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "compliance@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.basic_snapshot_guard.aws_cloudwatch_event_rule.public_snapshot_alert will be created
  + resource "aws_cloudwatch_event_rule" "public_snapshot_alert" {
      + arn            = (known after apply)
      + description    = "Alerts on creation or modification of public EBS snapshots."
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName         = [
                      + "ModifySnapshotAttribute",
                    ]
                  + eventSource       = [
                      + "ec2.amazonaws.com",
                    ]
                  + requestParameters = {
                      + attributeType = [
                          + "createVolumePermission",
                        ]
                      + operationType = [
                          + "add",
                        ]
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "basic-ebs-guard-public-snapshot-alert"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.basic_snapshot_guard.aws_cloudwatch_event_target.sns_alert will be created
  + resource "aws_cloudwatch_event_target" "sns_alert" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "basic-ebs-guard-public-snapshot-alert"
      + target_id      = "SnapshotAlertSNS"
    }

  # module.basic_snapshot_guard.aws_dlm_lifecycle_policy.snapshot_retention_policy will be created
  + resource "aws_dlm_lifecycle_policy" "snapshot_retention_policy" {
      + arn                = (known after apply)
      + description        = "EBS Snapshot retention and auto-deletion"
      + execution_role_arn = (known after apply)
      + id                 = (known after apply)
      + state              = "ENABLED"
      + tags_all           = (known after apply)

      + policy_details {
          + policy_type        = "EBS_SNAPSHOT_MANAGEMENT"
          + resource_locations = (known after apply)
          + resource_types     = [
              + "VOLUME",
            ]
          + target_tags        = {
              + "SnapshotManaged" = "true"
            }

          + schedule {
              + copy_tags = true
              + name      = "DailySnapshotRetention"

              + create_rule {
                  + interval      = 24
                  + interval_unit = "HOURS"
                  + location      = (known after apply)
                  + times         = [
                      + "00:00",
                    ]
                }

              + retain_rule {
                  + count = 7
                }
            }
        }
    }

  # module.basic_snapshot_guard.aws_iam_policy.snapshot_encryption_policy will be created
  + resource "aws_iam_policy" "snapshot_encryption_policy" {
      + arn         = (known after apply)
      + description = "Policy enforcing EBS snapshot encryption."
      + id          = (known after apply)
      + name        = "basic-ebs-guard-snapshot-encryption"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:CreateSnapshot",
                          + "ec2:CreateSnapshots",
                        ]
                      + Condition = {
                          + StringNotEqualsIfExists = {
                              + "ec2:Encrypted" = "true"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.basic_snapshot_guard.aws_iam_role.dlm_role will be created
  + resource "aws_iam_role" "dlm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dlm.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "basic-ebs-guard-dlm-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.basic_snapshot_guard.aws_iam_role_policy_attachment.dlm_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "dlm_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSDataLifecycleManagerServiceRole"
      + role       = "basic-ebs-guard-dlm-role"
    }

  # module.basic_snapshot_guard.aws_sns_topic.snapshot_alerts_topic will be created
  + resource "aws_sns_topic" "snapshot_alerts_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "basic-ebs-guard-snapshot-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.basic_snapshot_guard.aws_sns_topic_subscription.alert_email[0] will be created
  + resource "aws_sns_topic_subscription" "alert_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "alerts@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->